Jajukym/hello-world/Cypress/Combine_4.0/Combine.cydsn/Generated_Source/PSoC5/statusButton.h
/*******************************************************************************
* File Name: statusButton.h  
* Version 1.90
*
* Description:
*  This file containts Status Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_STATUS_REG_statusButton_H) /* CY_STATUS_REG_statusButton_H */
#define CY_STATUS_REG_statusButton_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
    #include "CyLib.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 statusState;

} statusButton_BACKUP_STRUCT;


/***************************************
*        Function Prototypes
***************************************/

uint8 statusButton_Read(void) ;
void statusButton_InterruptEnable(void) ;
void statusButton_InterruptDisable(void) ;
void statusButton_WriteMask(uint8 mask) ;
uint8 statusButton_ReadMask(void) ;


/***************************************
*           API Constants
***************************************/

#define statusButton_STATUS_INTR_ENBL    0x10u


/***************************************
*         Parameter Constants
***************************************/

/* Status Register Inputs */
#define statusButton_INPUTS              8


/***************************************
*             Registers
***************************************/

/* Status Register */
#define statusButton_Status             (* (reg8 *) statusButton_sts_sts_reg__STATUS_REG )
#define statusButton_Status_PTR         (  (reg8 *) statusButton_sts_sts_reg__STATUS_REG )
#define statusButton_Status_Mask        (* (reg8 *) statusButton_sts_sts_reg__MASK_REG )
#define statusButton_Status_Aux_Ctrl    (* (reg8 *) statusButton_sts_sts_reg__STATUS_AUX_CTL_REG )

#endif /* End CY_STATUS_REG_statusButton_H */


/* [] END OF FILE */
